elechou/Viewer2000/cpu1/sysconfig_cpu1.syscfg
cmpss2.$name                = "PHASE_B_CURRENT_CMPSS";
cmpss2.cmpssBase            = "CMPSS8_BASE";
cmpss2.enableModule         = true;
cmpss2.hysteresisVal        = "1";
cmpss2.highCTRIPOUT         = "CMPSS_TRIPOUT_FILTER";
cmpss2.highCTRIP            = "CMPSS_TRIP_FILTER";
cmpss2.dacValHigh           = 3584;
cmpss2.initFilterHigh       = true;
cmpss2.clearFilterLatchHigh = true;
cmpss2.samplePrescaleHigh   = 32;
cmpss2.sampleWindowHigh     = 32;
cmpss2.thresholdHigh        = 30;
cmpss2.asysCMPHPMXSELValue  = "1";
cmpss2.lowCompInvert        = true;
cmpss2.lowCTRIPOUT          = "CMPSS_TRIPOUT_FILTER";
cmpss2.lowCTRIP             = "CMPSS_TRIP_FILTER";
cmpss2.dacValLow            = 512;
cmpss2.initFilterLow        = true;
cmpss2.clearFilterLatchLow  = true;
cmpss2.samplePrescaleLow    = 32;
cmpss2.sampleWindowLow      = 32;
cmpss2.thresholdLow         = 30;
cmpss2.asysCMPLPMXSELValue  = "1";

analog1.$name            = "myANALOGPinMux0";
adc1.analog              = analog1;
analog1.useCase          = "CUSTOM";
adc2.analog              = analog1;
adc3.analog              = analog1;
analog1.useInterfacePins = ["A10, GPIO213","A15/B15/C15","A5","A8, GPIO211","B3","B6, GPIO207","C5, GPIO204"];
cmpss1.analog            = analog1;
cmpss2.analog            = analog1;

cputimer1.cputimerBase  = "CPUTIMER1_BASE";
cputimer1.timerPeriod   = 4294967295;
cputimer1.emulationMode = "CPUTIMER_EMULATIONMODE_RUNFREE";
cputimer1.startTimer    = true;
cputimer1.$name         = "ISR_CYCLE_TIMER";

epwm1.$name                                                         = "PWM_TB";
epwm1.$hardware                                                     = system.deviceData.board.components.BP_SITE_2.subComponents.PWM_LOC2;
epwm1.epwmTimebase_counterMode                                      = "EPWM_COUNTER_MODE_UP_DOWN";
epwm1.epwmTimebase_hsClockDiv                                       = "EPWM_HSCLOCK_DIVIDER_1";
epwm1.epwmTimebase_emulationMode                                    = "EPWM_EMULATION_FREE_RUN";
epwm1.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPA      = "EPWM_AQ_OUTPUT_HIGH";
epwm1.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_DOWN_CMPA    = "EPWM_AQ_OUTPUT_LOW";
epwm1.epwmDeadband_delayRED                                         = 200;
epwm1.epwmDeadband_delayFED                                         = 200;
epwm1.epwmDeadband_enableFED                                        = true;
epwm1.epwmDeadband_polarityFED                                      = "EPWM_DB_POLARITY_ACTIVE_LOW";
epwm1.epwmDeadband_enableRED                                        = true;
epwm1.epwmDeadband_redShadowMode                                    = true;
epwm1.epwmDeadband_fedShadowMode                                    = true;
epwm1.epwmTripZone_EPWM_TZ_ACTION_EVENT_TZA                         = "EPWM_TZ_ACTION_LOW";
epwm1.epwmTripZone_EPWM_TZ_ACTION_EVENT_TZB                         = "EPWM_TZ_ACTION_LOW";
epwm1.epwmTripZone_oneShotSource                                    = ["EPWM_TZ_SIGNAL_OSHT1"];
epwm1.epwmTripZone_cbcSource                                        = ["EPWM_TZ_SIGNAL_CBC6"];
epwm1.epwmEventTrigger_EPWM_SOC_A_triggerEnable                     = true;
epwm1.epwmEventTrigger_EPWM_SOC_A_triggerEventPrescalar             = "1";
epwm1.epwmTimebase_period                                           = 5000;
epwm1.epwmCounterCompare_cmpA                                       = 2500;
epwm1.epwmTimebase_syncOutPulseMode                                 = ["EPWM_SYNC_OUT_PULSE_ON_CNTR_ZERO"];
epwm1.epwmTripZone_EPWM_TZ_ACTION_EVENT_DCAEVT1                     = "EPWM_TZ_ACTION_DISABLE";
epwm1.epwmTripZone_EPWM_TZ_ACTION_EVENT_DCBEVT1                     = "EPWM_TZ_ACTION_DISABLE";
epwm1.epwmDigitalCompare_EPWM_DC_TYPE_DCAH                          = "EPWM_DC_TRIP_TRIPIN7";
epwm1.epwmDigitalCompare_EPWM_DC_TYPE_DCBH                          = "EPWM_DC_TRIP_TRIPIN7";
epwm1.epwmDigitalCompare_EPWM_TZ_DC_OUTPUT_A1                       = "EPWM_TZ_EVENT_DCXH_HIGH";
epwm1.epwmDigitalCompare_EPWM_TZ_DC_OUTPUT_B1                       = "EPWM_TZ_EVENT_DCXH_HIGH";
epwm1.epwmDigitalCompare_EPWM_DC_MODULE_A_EPWM_DC_EVENT_1_eventSync = "EPWM_DC_EVENT_INPUT_NOT_SYNCED";
epwm1.epwmDigitalCompare_EPWM_DC_MODULE_B_EPWM_DC_EVENT_1_eventSync = "EPWM_DC_EVENT_INPUT_NOT_SYNCED";
epwm1.epwm.$assign                                                  = "EPWM1";
epwm1.epwm.epwm_aPin.$assign                                        = "boosterpack2.78";
epwm1.epwm.epwm_bPin.$assign                                        = "boosterpack2.77";

epwm2.$name                                                         = "PWM_PHASE_A";
epwm2.$hardware                                                     = system.deviceData.board.components.BP_SITE_2.subComponents.PWM_LOC1;
epwm2.epwmTimebase_emulationMode                                    = "EPWM_EMULATION_FREE_RUN";
epwm2.epwmTimebase_hsClockDiv                                       = "EPWM_HSCLOCK_DIVIDER_1";
epwm2.epwmTimebase_period                                           = 5000;
epwm2.epwmTimebase_counterMode                                      = "EPWM_COUNTER_MODE_UP_DOWN";
epwm2.epwmTimebase_phaseEnable                                      = true;
epwm2.epwmCounterCompare_cmpA                                       = 2500;
epwm2.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPA      = "EPWM_AQ_OUTPUT_HIGH";
epwm2.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_DOWN_CMPA    = "EPWM_AQ_OUTPUT_LOW";
epwm2.epwmDeadband_polarityFED                                      = "EPWM_DB_POLARITY_ACTIVE_LOW";
epwm2.epwmDeadband_enableRED                                        = true;
epwm2.epwmDeadband_enableFED                                        = true;
epwm2.epwmDeadband_redShadowMode                                    = true;
epwm2.epwmDeadband_fedShadowMode                                    = true;
epwm2.epwmDeadband_delayRED                                         = 200;
epwm2.epwmDeadband_delayFED                                         = 200;
epwm2.epwmTripZone_EPWM_TZ_ACTION_EVENT_TZA                         = "EPWM_TZ_ACTION_LOW";
epwm2.epwmTripZone_EPWM_TZ_ACTION_EVENT_TZB                         = "EPWM_TZ_ACTION_LOW";
epwm2.epwmTripZone_oneShotSource                                    = ["EPWM_TZ_SIGNAL_OSHT1"];
epwm2.epwmTripZone_cbcSource                                        = ["EPWM_TZ_SIGNAL_CBC6"];
epwm2.epwmTimebase_counterModeAfterSync                             = "EPWM_COUNT_MODE_UP_AFTER_SYNC";
epwm2.epwmTripZone_EPWM_TZ_ACTION_EVENT_DCAEVT1                     = "EPWM_TZ_ACTION_DISABLE";
epwm2.epwmTripZone_EPWM_TZ_ACTION_EVENT_DCBEVT1                     = "EPWM_TZ_ACTION_DISABLE";
epwm2.epwmDigitalCompare_EPWM_DC_TYPE_DCAH                          = "EPWM_DC_TRIP_TRIPIN7";
epwm2.epwmDigitalCompare_EPWM_DC_TYPE_DCBH                          = "EPWM_DC_TRIP_TRIPIN7";
epwm2.epwmDigitalCompare_EPWM_TZ_DC_OUTPUT_A1                       = "EPWM_TZ_EVENT_DCXH_HIGH";
epwm2.epwmDigitalCompare_EPWM_TZ_DC_OUTPUT_B1                       = "EPWM_TZ_EVENT_DCXH_HIGH";
epwm2.epwmDigitalCompare_EPWM_DC_MODULE_A_EPWM_DC_EVENT_1_eventSync = "EPWM_DC_EVENT_INPUT_NOT_SYNCED";
epwm2.epwmDigitalCompare_EPWM_DC_MODULE_B_EPWM_DC_EVENT_1_eventSync = "EPWM_DC_EVENT_INPUT_NOT_SYNCED";

epwm3.$name                                                         = "PWM_PHASE_C";
epwm3.$hardware                                                     = system.deviceData.board.components.BP_SITE_2.subComponents.PWM_LOC3;
epwm3.epwmTimebase_emulationMode                                    = "EPWM_EMULATION_FREE_RUN";
epwm3.epwmTimebase_hsClockDiv                                       = "EPWM_HSCLOCK_DIVIDER_1";
epwm3.epwmTimebase_period                                           = 5000;
epwm3.epwmTimebase_counterMode                                      = "EPWM_COUNTER_MODE_UP_DOWN";
epwm3.epwmTimebase_phaseEnable                                      = true;
epwm3.epwmCounterCompare_cmpA                                       = 2500;
epwm3.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPA      = "EPWM_AQ_OUTPUT_HIGH";
epwm3.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_DOWN_CMPA    = "EPWM_AQ_OUTPUT_LOW";
epwm3.epwmDeadband_polarityFED                                      = "EPWM_DB_POLARITY_ACTIVE_LOW";
epwm3.epwmDeadband_enableRED                                        = true;
epwm3.epwmDeadband_enableFED                                        = true;
epwm3.epwmDeadband_redShadowMode                                    = true;
epwm3.epwmDeadband_fedShadowMode                                    = true;
epwm3.epwmDeadband_delayRED                                         = 200;
epwm3.epwmDeadband_delayFED                                         = 200;
epwm3.epwmTripZone_EPWM_TZ_ACTION_EVENT_TZA                         = "EPWM_TZ_ACTION_LOW";
epwm3.epwmTripZone_EPWM_TZ_ACTION_EVENT_TZB                         = "EPWM_TZ_ACTION_LOW";
epwm3.epwmTripZone_oneShotSource                                    = ["EPWM_TZ_SIGNAL_OSHT1"];
epwm3.epwmTripZone_cbcSource                                        = ["EPWM_TZ_SIGNAL_CBC6"];
epwm3.epwmTimebase_counterModeAfterSync                             = "EPWM_COUNT_MODE_UP_AFTER_SYNC";
epwm3.epwmTripZone_EPWM_TZ_ACTION_EVENT_DCAEVT1                     = "EPWM_TZ_ACTION_DISABLE";
epwm3.epwmTripZone_EPWM_TZ_ACTION_EVENT_DCBEVT1                     = "EPWM_TZ_ACTION_DISABLE";
epwm3.epwmDigitalCompare_EPWM_DC_TYPE_DCAH                          = "EPWM_DC_TRIP_TRIPIN7";
epwm3.epwmDigitalCompare_EPWM_DC_TYPE_DCBH                          = "EPWM_DC_TRIP_TRIPIN7";
epwm3.epwmDigitalCompare_EPWM_TZ_DC_OUTPUT_A1                       = "EPWM_TZ_EVENT_DCXH_HIGH";
epwm3.epwmDigitalCompare_EPWM_TZ_DC_OUTPUT_B1                       = "EPWM_TZ_EVENT_DCXH_HIGH";
epwm3.epwmDigitalCompare_EPWM_DC_MODULE_A_EPWM_DC_EVENT_1_eventSync = "EPWM_DC_EVENT_INPUT_NOT_SYNCED";
epwm3.epwmDigitalCompare_EPWM_DC_MODULE_B_EPWM_DC_EVENT_1_eventSync = "EPWM_DC_EVENT_INPUT_NOT_SYNCED";

epwmxbar1.$name      = "POWER_TRIP_XBAR";
epwmxbar1.tripInput  = "XBAR_TRIP7";
epwmxbar1.muxesUsed  = ["XBAR_MUX01","XBAR_MUX12","XBAR_MUX13","XBAR_MUX14","XBAR_MUX15"];
epwmxbar1.mux1Config = "XBAR_EPWM_MUX01_ADCCEVT1";

gpio1.$name             = "ISR_PROBE";
gpio1.direction         = "GPIO_DIR_MODE_OUT";
gpio1.writeInitialValue = true;
gpio1.gpioPin.$assign   = "boosterpack2.73";

