elechou/Viewer2000/cpu1/sysconfig_cpu1.syscfg
gpio2.$name             = "TZ_EXT";
gpio2.padConfig         = "PULLUP";
gpio2.qualMode          = "GPIO_QUAL_ASYNC";
gpio2.writeInitialValue = true;
gpio2.initialValue      = 1;
gpio2.gpioPin.$assign   = "boosterpack2.48";

gpio3.$name             = "DRV_ENABLE";
gpio3.direction         = "GPIO_DIR_MODE_OUT";
gpio3.writeInitialValue = true;
gpio3.gpioPin.$assign   = "boosterpack2.44";

gpio4.$name             = "DRV_CS";
gpio4.direction         = "GPIO_DIR_MODE_OUT";
gpio4.writeInitialValue = true;
gpio4.initialValue      = 1;
gpio4.gpioPin.$assign   = "boosterpack2.52";

i2c1.$name                  = "AS5600_I2C";
i2c1.$hardware              = system.deviceData.board.components.BP_SITE_1.subComponents.I2C;
i2c1.bitCount               = "I2C_BITCOUNT_8";
i2c1.useInterrupts          = false;
i2c1.emulationMode          = "I2C_EMULATION_FREE_RUN";
i2c1.useFifo                = false;
i2c1.i2c.$assign            = "I2CA";
i2c1.i2c.i2c_sdaPin.$assign = "boosterpack1.10";
i2c1.i2c.i2c_sclPin.$assign = "boosterpack1.9";

inputxbar_input1.$name         = "TZ_EXT_INPUT_XBAR";
inputxbar_input1.inputxbarGpio = "GPIO82";
inputxbar_input1.inputxbarLock = true;

spi1.$name                   = "DRV_SPI";
spi1.useCase                 = "3-WIRE CONTROLLER";
spi1.mode                    = "SPI_MODE_CONTROLLER";
spi1.emulationMode           = "SPI_EMULATION_FREE_RUN";
spi1.useInterrupts           = false;
spi1.bitRate                 = 400000;
spi1.picoQual.$name          = "myGPIOQUAL0";
spi1.pociQual.$name          = "myGPIOQUAL1";
spi1.clkQual.$name           = "myGPIOQUAL2";
spi1.spi.$assign             = "SPID";
spi1.spi.spi_picoPin.$assign = "boosterpack2.55";
spi1.spi.spi_pociPin.$assign = "boosterpack2.54";
spi1.spi.spi_clkPin.$assign  = "boosterpack2.47";

sysctl.cpuSel_SCIA = "SYSCTL_CPUSEL_CPU2";

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
led1.gpio.gpioPin.$suggestSolution                 = "boosterpack1.13";
led2.gpio.gpioPin.$suggestSolution                 = "boosterpack2.53";
analog1.analog.$suggestSolution                    = "ANALOG";
analog1.analog["a10, gpio213Pin"].$suggestSolution = "boosterpack2.67";
analog1.analog["a15/b15/c15Pin"].$suggestSolution  = "boosterpack2.63";
analog1.analog.a5Pin.$suggestSolution              = "boosterpack2.42";
analog1.analog["a8, gpio211Pin"].$suggestSolution  = "boosterpack2.64";
analog1.analog.b3Pin.$suggestSolution              = "boosterpack2.65";
analog1.analog["b6, gpio207Pin"].$suggestSolution  = "boosterpack2.68";
analog1.analog["c5, gpio204Pin"].$suggestSolution  = "boosterpack2.66";
epwm2.epwm.$suggestSolution                        = "EPWM2";
epwm2.epwm.epwm_aPin.$suggestSolution              = "boosterpack2.80";
epwm2.epwm.epwm_bPin.$suggestSolution              = "boosterpack2.79";
epwm3.epwm.$suggestSolution                        = "EPWM8";
epwm3.epwm.epwm_aPin.$suggestSolution              = "boosterpack2.76";
epwm3.epwm.epwm_bPin.$suggestSolution              = "boosterpack2.75";
